[
    {
        "productName": "Razer Blade 15 Advanced Model",
        "category": "Laptops",
        "company": "Razer",
        "storage": 1000,
        "ram": 32,
        "cpu": "Intel Core i7-12800H",
        "gpu": "NVIDIA GeForce RTX 3080 Ti",
        "color": "Black",
        "price": 3399.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/RazerBlade15AdvancedModel-1.webp",
            "photoTwo": "/images/RazerBlade15AdvancedModel-2.webp",
            "photoThree": "/images/RazerBlade15AdvancedModel-3.webp",
            "photoFour": "/images/RazerBlade15AdvancedModel-4.webp"
        },
        "description": "The Razer Blade 15 Advanced Model is a sleek and powerful gaming laptop, combining cutting-edge technology with a stylish design. Featuring 12th Gen Intel Core processors and NVIDIA GeForce RTX graphics, it ensures smooth gaming and fast rendering. The high-refresh-rate display delivers a responsive visual experience, while the thin aluminum chassis adds durability and sophistication. The customizable RGB keyboard and advanced cooling system enhance the overall gaming experience. With Thunderbolt 3 connectivity, immersive THX Spatial Audio, and ample SSD storage options, it caters to both gamers and creative professionals. The integration of Windows Hello facial recognition and Razer Synapse software for customization completes this laptop, making it a versatile and high-performance solution."
    },
    {
        "productName": "Lenovo Legion 9 16IRX8",
        "category": "Laptops",
        "company": "Lenovo",
        "storage": 2000,
        "ram": 64,
        "cpu": "Intel Core i7-12800H",
        "gpu": "NVIDIA GeForce RTX 3080 Ti",
        "color": "Black",
        "price": 3399.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/LenovoLegion9-16IRX8-1.webp",
            "photoTwo": "/images/LenovoLegion9-16IRX8-2.webp",
            "photoThree": "/images/LenovoLegion9-16IRX8-3.webp",
            "photoFour": "/images/LenovoLegion9-16IRX8-4.webp"
        },
        "description": "The Lenovo Legion 9 16IRX8 is a formidable gaming laptop, designed for peak performance and immersive gameplay. With a robust Intel Core i9 processor and powerful NVIDIA GeForce RTX graphics, it ensures smooth gaming and rapid content rendering. The high-refresh-rate display enhances visual experiences, ideal for demanding gaming sessions. The premium build quality and customizable RGB keyboard create a personalized gaming setup, complemented by advanced cooling for optimal performance. Ample storage options, including high-capacity SSDs, cater to storage needs for games and multimedia projects. Dolby Atmos technology delivers a rich audio experience, enhancing both gaming and multimedia consumption. Connectivity options, including USB-C and HDMI ports, provide versatility for external devices. Lenovo Vantage software enables users to fine-tune settings, optimizing the laptop's performance. An integrated webcam with a privacy shutter adds a layer of security for user privacy. In essence, the Lenovo Legion 9 16IRX8 combines power, aesthetics, and functionality, making it an ideal choice for gamers and content creators alike."
    },
    {
        "productName": "Asus ROG Strix Scar 17 G733PY-LL020X",
        "category": "Laptops",
        "company": "Asus",
        "storage": 2000,
        "ram": 32,
        "cpu": "AMD Ryzen 9 7945HX",
        "gpu": "NVIDIA GeForce RTX 4090",
        "color": "Black",
        "price": 3999.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AsusROGStrixScar17-G733PY-LL020X-1.webp",
            "photoTwo": "/images/AsusROGStrixScar17-G733PY-LL020X-2.webp",
            "photoThree": "/images/AsusROGStrixScar17-G733PY-LL020X-3.webp",
            "photoFour": "/images/AsusROGStrixScar17-G733PY-LL020X-4.webp"
        },
        "description": "The Asus ROG Strix Scar 17 G733PY-LL020X is a high-performance gaming laptop tailored for enthusiasts seeking top-tier gaming experiences. Fueled by an AMD Ryzen processor and an NVIDIA GeForce RTX GPU, it ensures seamless gameplay and accelerated content creation. The laptop's 17-inch display, with a high refresh rate, delivers vibrant visuals and smooth graphics ideal for intense gaming sessions. The RGB-backlit keyboard, featuring customizable lighting, enhances the gaming atmosphere. Robust cooling mechanisms maintain optimal temperature levels during extended gaming, ensuring consistent performance. Ample storage options, including high-speed SSDs, provide quick access to games and multimedia projects. With an array of ports, including USB-C and HDMI, the laptop accommodates various external devices. The laptop's premium build quality reflects the ROG Strix series' signature aesthetics, while ASUS Armoury Crate software allows users to fine-tune settings for personalized experiences. The Scar 17 is a gaming powerhouse, combining cutting-edge hardware, advanced cooling, and customizable features for an immersive gaming and content creation experience."
    },
    {
        "productName": "Acer Enduro N7 EN715-51W-7243",
        "category": "Laptops",
        "company": "Acer",
        "storage": 512,
        "ram": 16,
        "cpu": "Intel Core i7-8550U",
        "gpu": "Intel UHD Graphics 620",
        "color": "Black",
        "price": 3999.99,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AcerEnduro-N7-EN715-51W-7243-1.webp",
            "photoTwo": "/images/AcerEnduro-N7-EN715-51W-7243-2.webp",
            "photoThree": "/images/AcerEnduro-N7-EN715-51W-7243-3.webp",
            "photoFour": "/images/AcerEnduro-N7-EN715-51W-7243-4.webp"
        },
        "description": "The Acer Enduro N7 EN715-51W-7243 is a rugged and durable laptop designed to withstand challenging environments, making it an ideal choice for professionals working in demanding industries. Engineered for durability, it meets MIL-STD-810G and IP65 standards, ensuring resistance to water, dust, and extreme temperatures. The laptop is powered by a reliable Intel processor, providing efficient performance for various tasks. Its 11.6-inch display offers crisp visuals, and the laptop's ruggedized chassis protects it from accidental drops and impacts. The spill-resistant keyboard enhances usability in unpredictable surroundings. Equipped with ample connectivity options, including USB and HDMI ports, the Enduro N7 facilitates seamless integration with external devices. The laptop's long-lasting battery ensures extended productivity in the field. It also features a hot-swappable battery design, allowing users to replace the battery without shutting down the system. Security features like a built-in fingerprint reader enhance data protection, catering to the needs of professionals handling sensitive information. With Windows 10 Pro, the laptop provides a familiar and secure operating environment. In summary, the Acer Enduro N7 EN715-51W-7243 is a robust and reliable laptop designed for professionals in challenging work environments. Its durability, performance, and security features make it a dependable choice for those who require a rugged computing solution."
    },
    {
        "productName": "Asus Zenbook Pro Duo 15 OLED UX582ZW-H2037X",
        "category": "Laptops",
        "company": "Asus",
        "storage": 1000,
        "ram": 32,
        "cpu": "Intel Core i9-12900H",
        "gpu": "NVIDIA GeForce RTX 3070 Ti",
        "color": "Blue",
        "price": 3399.99,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AsusZenbookProDuo15OLEDUX582ZW-H2037X-1.webp",
            "photoTwo": "/images/AsusZenbookProDuo15OLEDUX582ZW-H2037X-2.webp",
            "photoThree": "/images/AsusZenbookProDuo15OLEDUX582ZW-H2037X-3.webp",
            "photoFour": "/images/AsusZenbookProDuo15OLEDUX582ZW-H2037X-4.webp"
        },
        "description": "The Asus ZenBook Pro Duo 15 OLED UX582ZW-H2037X is a cutting-edge laptop that redefines productivity and creativity with its innovative design and powerful features. The standout feature is its dual-screen setup, featuring a main 15.6-inch OLED 4K touchscreen and a secondary 14-inch ScreenPad Plus, offering extended workspace and multitasking capabilities. Powered by an Intel Core i9 processor and NVIDIA GeForce RTX 3070 graphics, this laptop delivers exceptional performance for demanding tasks such as content creation and gaming. The OLED display provides vibrant colors and deep blacks, ensuring an immersive visual experience. The ScreenPad Plus adds a new dimension to workflow efficiency, allowing users to run multiple applications simultaneously or use it as a dedicated interface for creative tools. The laptop's design is sleek and premium, with a precision-engineered hinge lifting the secondary display for optimal viewing. Extensive connectivity options, including Thunderbolt 3 ports, enhance versatility, while the ErgoLift hinge improves typing comfort and cooling. The laptop also features ASUS NumberPad for enhanced productivity. The ZenBook Pro Duo 15 OLED is a powerhouse for professionals and creative individuals, combining top-tier performance, innovative dual-screen technology, and a sophisticated design, making it an excellent choice for those seeking a high-performance and versatile laptop."
    },
    {
        "productName": "Asus ProArt Studiobook 16 OLED H7604JI-MY064",
        "category": "Laptops",
        "company": "Asus",
        "storage": 2000,
        "ram": 32,
        "cpu": "Intel Core i9-13980HX",
        "gpu": "NVIDIA GeForce RTX 4070",
        "color": "Blue",
        "price": 2999.99,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AsusProArtStudiobook16OLEDH7604JI-MY064-1.webp",
            "photoTwo": "/images/AsusProArtStudiobook16OLEDH7604JI-MY064-2.webp",
            "photoThree": "/images/AsusProArtStudiobook16OLEDH7604JI-MY064-3.webp",
            "photoFour": "/images/AsusProArtStudiobook16OLEDH7604JI-MY064-4.webp"
        },
        "description": "The Asus ProArt Studiobook 16 OLED H7604JI-MY064 is a powerful and innovative laptop designed for creative professionals. Featuring a stunning 16-inch OLED display, it delivers vibrant colors and deep blacks for an exceptional visual experience. The laptop is equipped with high-performance components, including an Intel Core processor, providing fast and efficient multitasking capabilities. Its sleek and portable design makes it ideal for on-the-go professionals, while the ProArt Calibration technology ensures color accuracy for content creation. With a comprehensive set of connectivity options, including USB-C and Thunderbolt ports, the Studiobook 16 offers versatility in connecting external devices. The durable build quality and premium materials enhance its overall durability, making it a reliable choice for demanding creative tasks. Overall, the Asus ProArt Studiobook 16 OLED H7604JI-MY064 combines cutting-edge technology with a design tailored to meet the needs of professionals in the creative industry."
    },
    {
        "productName": "MacBook Air M1 256GB 8GB Silver",
        "category": "Laptops",
        "company": "Apple",
        "storage": 256,
        "ram": 8,
        "cpu": "M1",
        "color": "Silver",
        "price": 999,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/macBookAirM1-Silver-1.webp",
            "photoTwo": "/images/macBookAirM1-Silver-2.webp",
            "photoThree": "/images/macBookAirM1-Silver-3.webp",
            "photoFour": "/images/macBookAirM1-Silver-4.webp",
            "photoFive": "/images/macBookAirM1-Silver-5.webp"
        },
        "description": "The MacBook Air M1 256GB 8GB is a sleek and powerful laptop by Apple. Powered by the groundbreaking M1 chip, it delivers impressive performance and energy efficiency. With 256GB of storage, you have ample space for files and applications, while 8GB of RAM ensures smooth multitasking. The Silver color adds a touch of elegance to the lightweight and portable design, making it a stylish choice for users on the go. The Retina display provides sharp and vibrant visuals, and the Magic Keyboard offers a comfortable typing experience. The MacBook Air M1 also boasts long battery life, enabling extended usage between charges. It runs on macOS, offering a seamless integration of hardware and software for a user-friendly experience. This laptop is an excellent option for those seeking a blend of performance, portability, and the iconic Apple design."
    },
    {
        "productName": "MacBook Air M1 512GB 16GB Silver",
        "category": "Laptops",
        "company": "Apple",
        "storage": 512,
        "ram": 16,
        "cpu": "M1",
        "color": "Silver",
        "price": 1199,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/macBookAirM1-Silver-1.webp",
            "photoTwo": "/images/macBookAirM1-Silver-2.webp",
            "photoThree": "/images/macBookAirM1-Silver-3.webp",
            "photoFour": "/images/macBookAirM1-Silver-4.webp",
            "photoFive": "/images/macBookAirM1-Silver-5.webp"
        },
        "description": "The MacBook Air M1 512GB 16GB is a sleek and powerful laptop by Apple. Powered by the groundbreaking M1 chip, it delivers impressive performance and energy efficiency. With 512GB of storage, you have ample space for files and applications, while 16GB of RAM ensures smooth multitasking. The Silver color adds a touch of elegance to the lightweight and portable design, making it a stylish choice for users on the go. The Retina display provides sharp and vibrant visuals, and the Magic Keyboard offers a comfortable typing experience. The MacBook Air M1 also boasts long battery life, enabling extended usage between charges. It runs on macOS, offering a seamless integration of hardware and software for a user-friendly experience. This laptop is an excellent option for those seeking a blend of performance, portability, and the iconic Apple design."
    },
    {
        "productName": "MacBook Air M1 256GB 8GB Space Gray",
        "category": "Laptops",
        "company": "Apple",
        "storage": 256,
        "ram": 8,
        "cpu": "M1",
        "color": "Space Gray",
        "price": 999,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/macBookAirM1-spaceGray-1.webp",
            "photoTwo": "/images/macBookAirM1-spaceGray-2.webp",
            "photoThree": "/images/macBookAirM1-spaceGray-3.webp",
            "photoFour": "/images/macBookAirM1-spaceGray-4.webp",
            "photoFive": "/images/macBookAirM1-spaceGray-5.webp"
        },
        "description": "The MacBook Air M1 256GB 8GB is a sleek and powerful laptop by Apple. Powered by the groundbreaking M1 chip, it delivers impressive performance and energy efficiency. With 256GB of storage, you have ample space for files and applications, while 8GB of RAM ensures smooth multitasking. The Silver color adds a touch of elegance to the lightweight and portable design, making it a stylish choice for users on the go. The Retina display provides sharp and vibrant visuals, and the Magic Keyboard offers a comfortable typing experience. The MacBook Air M1 also boasts long battery life, enabling extended usage between charges. It runs on macOS, offering a seamless integration of hardware and software for a user-friendly experience. This laptop is an excellent option for those seeking a blend of performance, portability, and the iconic Apple design."
    },
    {
        "productName": "MacBook Air M1 256GB 8GB Gold",
        "category": "Laptops",
        "company": "Apple",
        "storage": 256,
        "ram": 8,
        "cpu": "M1",
        "color": "Gold",
        "price": 999,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/macBookAirM1-gold-1.webp",
            "photoTwo": "/images/macBookAirM1-gold-2.webp",
            "photoThree": "/images/macBookAirM1-gold-3.webp",
            "photoFour": "/images/macBookAirM1-gold-4.webp",
            "photoFive": "/images/macBookAirM1-gold-5.webp"
        },
        "description": "The MacBook Air M1 256GB 8GB is a sleek and powerful laptop by Apple. Powered by the groundbreaking M1 chip, it delivers impressive performance and energy efficiency. With 256GB of storage, you have ample space for files and applications, while 8GB of RAM ensures smooth multitasking. The Silver color adds a touch of elegance to the lightweight and portable design, making it a stylish choice for users on the go. The Retina display provides sharp and vibrant visuals, and the Magic Keyboard offers a comfortable typing experience. The MacBook Air M1 also boasts long battery life, enabling extended usage between charges. It runs on macOS, offering a seamless integration of hardware and software for a user-friendly experience. This laptop is an excellent option for those seeking a blend of performance, portability, and the iconic Apple design."
    },
    {
        "productName": "Dell XPS 17 9720",
        "category": "Laptops",
        "company": "Dell",
        "storage": 256,
        "ram": 16,
        "cpu": "Intel Core i7-12700H",
        "gpu": "NVIDIA GeForce RTX 3050",
        "color": "Silver",
        "price": 3199.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/DellXPS179720-1.webp",
            "photoTwo": "/images/DellXPS179720-2.webp",
            "photoThree": "/images/DellXPS179720-3.webp",
            "photoFour": "/images/DellXPS179720-4.webp",
            "photoFive": "/images/DellXPS179720-5.webp"
        },
        "description": "Experience colossal power for your creativity with the XPS 17 laptop. Equipped with high-performance Intel Core processors and robust NVIDIA graphics cards, it effortlessly tackles complex creative tasks. The Intel Core processor, with increased cores and threads, supports Wi-Fi 6 for fast connectivity and Thunderbolt 4 for rapid file transfers. This enables seamless use of resource-intensive design software on a laptop. Elevate your creative projects with GeForce RTX 30 series graphics processors, offering AI acceleration for popular graphics applications. The NVIDIA Studio platform provides specialized drivers and tools for efficient workflow, whether rendering 3D scenes, editing 8K videos, or live streaming with high-quality encoding. The laptop boasts fast memory and spacious up to 2TB solid-state storage, ensuring swift system boot-up and multitasking. The Killer wireless adapter with Wi-Fi 6 support delivers blazing speeds, prioritizing streaming, data exchange, and gaming traffic. Dell Power Manager lets you customize system characteristics like fan speed, battery life, and performance modes, optimizing your preferences. The laptop's advanced thermal regulation system, including dual fans and an expansive vapor chamber, enhances airflow by 30%, preventing overheating and maintaining peak performance even in Turbo mode."
    },
    {
        "productName": "RavPower 20000mAh 60W PD USB-C+USB-A Black",
        "category": "Powerbanks",
        "capacity": 20000,
        "company": "RavPower",
        "color": "Black",
        "price": 59.99,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/mAh-60W-PD-USB-C-USB-A-Black-1.webp",
            "photoTwo": "/images/mAh-60W-PD-USB-C-USB-A-Black-2.webp",
            "photoThree": "/images/mAh-60W-PD-USB-C-USB-A-Black-3.webp",
            "photoFour": "/images/mAh-60W-PD-USB-C-USB-A-Black-4.webp"
        },
        "description": "High power for your laptop: The substantial 60W PD output ensures perfect charging for your MacBook Pro, matching the performance of the original charger. Powerful yet compact: With a 20000mAh battery capacity, it powers your iPhone 11 Pro Max up to 2.6 times, Galaxy S10 3.4 times, and iPad Pro 2018 1.6 times, providing almost a week of usage. Quick dual charging: Featuring one PD port and one QC port, it ensures you can charge your laptop and phone simultaneously at maximum speeds. 30W PD fast input: Achieve peak performance with the 30W PD charging adapter—fully charging the battery in just 3.5 hours. Reliable safety: Equipped with advanced charging protection, this charger is designed to safeguard against damage caused by current overload and overheating."
    },
    {
        "productName": "Nintendo Switch OLED White",
        "category": "Game-Consoles",
        "company": "Nintendo",
        "color": "White",
        "price": 349.99,
        "storage": 64,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/switchOled-1.webp",
            "photoTwo": "/images/switchOled-2.webp",
            "photoThree": "/images/switchOled-3.webp",
            "photoFour": "/images/switchOled-4.webp"
        },
        "description": "The Nintendo Switch OLED White is a gaming console that features a vibrant 7-inch OLED screen for enhanced visuals and colors. The white color variant adds a stylish and modern touch to the design. With a versatile gaming experience, it allows users to seamlessly transition between handheld, tabletop, and TV modes. The OLED screen provides sharp and vivid graphics, making gaming more immersive. The console retains the signature features of the Nintendo Switch, such as detachable Joy-Con controllers for multiplayer gaming and the innovative ability to dock and connect to the TV for a big-screen experience. The enhanced audio quality further adds to the immersive gaming experience. Whether playing popular titles or exploring new games, the Nintendo Switch OLED White offers a versatile and enjoyable gaming platform. It caters to a wide audience, from casual gamers to dedicated enthusiasts, and its portability makes it convenient for gaming on the go. Overall, the combination of the OLED display and the sleek white design makes the Nintendo Switch OLED White an appealing choice for gaming enthusiasts."
    },
    {
        "productName": "SonyPlaystation 5",
        "category": "Game-Consoles",
        "company": "Sony",
        "color": "White",
        "price": 549.99,
        "storage": 825,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/PlayStation5-1.webp",
            "photoTwo": "/images/PlayStation5-2.webp",
            "photoThree": "/images/PlayStation5-3.webp"
        },
        "description": "The Sony PlayStation 5 (PS5) represents the pinnacle of next-generation gaming, delivering a stunning combination of cutting-edge hardware and immersive gameplay experiences. Powered by a custom AMD Ryzen processor and an advanced GPU, the PS5 boasts unparalleled graphics and performance, supporting ray tracing for lifelike visuals. The innovative DualSense wireless controller introduces haptic feedback and adaptive triggers, enhancing tactile sensations and responsiveness. With an ultra-fast SSD, load times are dramatically reduced, allowing for seamless transitions between game scenes. The console supports 4K gaming and features a 4K UHD Blu-ray drive for high-quality media playback. The PS5's sleek design and futuristic aesthetic complement its technological prowess, making it a must-have for gaming enthusiasts eager to explore the next level of interactive entertainment."
    },
    {
        "productName": "Microsoft Xbox Series Х",
        "category": "Game-Consoles",
        "company": "Microsoft",
        "color": "Black",
        "price": 599.99,
        "storage": 1000,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/XboxSeriesХ-1.webp",
            "photoTwo": "/images/XboxSeriesХ-1.webp",
            "photoThree": "/images/XboxSeriesХ-1.webp"
        },
        "description": "The Microsoft Xbox Series X stands as a flagship in the realm of gaming consoles, embodying a powerhouse of performance and innovation. Boasting a custom AMD processor, the Series X delivers impressive graphics capabilities, supporting ray tracing and 4K gaming for a visually stunning experience. The console's Quick Resume feature allows seamless switching between multiple games, while the high-speed SSD significantly reduces loading times. The controller, retaining the familiar Xbox design, introduces enhancements like textured grips and a dedicated Share button. With Xbox Game Pass offering an extensive library of games, including titles optimized for the Series X, players have access to a diverse gaming ecosystem. The Series X's sleek monolithic design and robust hardware make it a top choice for gamers seeking a cutting-edge console for immersive and high-fidelity gaming experiences."
    },
    {
        "productName": "The Legend of Zelda: Tears of the Kingdom",
        "category": "Games",
        "company": "Nintendo",
        "platform": "Nintendo Switch",
        "price": 59.99,
        "inStock": true,
        "genre": "Action-adventure",
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/TheLegendOfZeldaTearsOfTheKingdom-1.webp",
            "photoTwo": "/images/TheLegendOfZeldaTearsOfTheKingdom-2.webp",
            "photoThree": "/images/TheLegendOfZeldaTearsOfTheKingdom-3.webp",
            "photoFour": "/images/TheLegendOfZeldaTearsOfTheKingdom-4.webp"
        },
        "description": "The Legend of Zelda: Tears of the Kingdom immerses players in an expansive open-world adventure, echoing the acclaimed gameplay of 'Breath of the Wild' (2017). As the iconic hero, Link, players traverse the familiar landscapes of Hyrule, now expanded to include two new regions—the sky, adorned with floating islands, and the Depths, an extensive underground realm beneath Hyrule. The game introduces Zonai devices, versatile tools utilized for combat, propulsion, exploration, and more. Departing from the previous runes, the game introduces five distinct abilities: Ultrahand, Fuse, Ascend, Recall, and Autobuild. Ultrahand empowers players to manipulate and combine objects, creating vehicles and structures with Zonai devices. Fuse allows Link to enhance weapons or shields by combining materials, adding unique attributes like explosive arrows. The Recall ability rewinds object movements, while Ascend enables vertical movement through solid surfaces. Autobuild simplifies crafting, instantly reconstructing Ultrahand-crafted devices, utilizing nearby materials. This imaginative blend of familiar Zelda elements and innovative mechanics promises an exhilarating and inventive gaming experience."
    },
    {
        "productName": "Batman: Arkham Trilogy",
        "category": "Games",
        "company": "Rocksteady",
        "platform": "Nintendo Switch",
        "price": 49.99,
        "inStock": true,
        "genre": "Action-adventure",
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/BatmanArkhamTrilogy-1.webp",
            "photoTwo": "/images/BatmanArkhamTrilogy-2.webp",
            "photoThree": "/images/BatmanArkhamTrilogy-3.webp"
        },
        "description": "Face off against notorious DC Super-Villains: The Joker, Scarecrow, Poison Ivy, and more in Batman: Arkham Asylum. Step into the shadows of Batman: Arkham City’s open world, the new maximum security “home” for thugs, gangsters, and insane criminal masterminds. In Batman: Arkham Knight, tear through the streets of Gotham and take on the ultimate threat in the trilogy’s epic conclusion."
    },
    {
        "productName": "Red Dead Redemption Nintendo Switch Version",
        "category": "Games",
        "platform": "Nintendo Switch",
        "company": "Rockstar Games",
        "price": 49.99,
        "inStock": true,
        "genre": "Action-adventure",
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/redDeadRedemptionSwitch-1.webp",
            "photoTwo": "/images/redDeadRedemptionSwitch-2.webp",
            "photoThree": "/images/redDeadRedemptionSwitch-3.webp",
            "photoFour": "/images/redDeadRedemptionSwitch-4.webp"
        },
        "description": "Red Dead Redemption is an iconic open-world action-adventure game that immerses players in the vast and immersive landscapes of the American Wild West during the early 20th century. Developed by Rockstar Games, this critically acclaimed title combines a compelling narrative with a stunningly detailed open-world environment. Players assume the role of John Marston, a former outlaw seeking redemption as he navigates through a morally complex and dynamic storyline. The game seamlessly blends elements of exploration, gunfights, and horseback riding, allowing players to engage in a variety of activities from bounty hunting to poker games. With its breathtaking visuals, a rich and atmospheric soundtrack, and a meticulously crafted world, Red Dead Redemption delivers an unforgettable gaming experience, capturing the essence of the Old West in all its glory and challenges."
    },
    {
        "productName": "Apple iPhone 14 Pro Max 256GB Deep Purple",
        "category": "Smartphones",
        "company": "Apple",
        "storage": 256,
        "cpu": "Apple A16 Bionic",
        "color": "Deep Purple",
        "price": 1299,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AppleiPhone14ProMaxDeepPurple-1.webp",
            "photoTwo": "/images/AppleiPhone14ProMaxDeepPurple-2.webp",
            "photoThree": "/images/AppleiPhone14ProMaxDeepPurple-3.webp",
            "photoFour": "/images/AppleiPhone14ProMaxDeepPurple-4.webp",
            "photoFive": "/images/AppleiPhone14ProMaxDeepPurple-5.webp"
        },
        "description": "The iPhone 14 Pro Max stands out with its impressive 6.7-inch Liquid Retina XDR OLED display featuring a dynamic 1-120Hz refresh rate and the innovative Always-On Display functionality. Powered by Apple's latest A16 Bionic chipset and 6GB of LPDDR5 RAM, it offers storage options ranging from 128GB to a top-tier 1TB variant. A notable addition is the customizable Always-On Display, allowing users to personalize it with wallpapers and widgets. The device adopts a dual SIM configuration globally, supporting nano SIM and eSIM, while in the US, it exclusively utilizes eSIM technology. The front Dynamic Island houses the TrueDepth camera for Face ID, facilitating swift Apple Pay transactions. The camera system introduces a remarkable 48MP quad-pixel sensor, incorporating 100% focus pixels, image stabilization, and a new Photonic Engine. With features like 3X optical zoom, 2X digital zoom, and enhanced Portrait mode, the iPhone 14 Pro Max promises a stellar photography experience."
    },
    {
        "productName": "MSI GE77 Raider HX12UHS",
        "category": "Laptops",
        "company": "MSI",
        "storage": 2000,
        "ram": 64,
        "cpu": "Intel Core i9-12900HX",
        "gpu": "NVIDIA GeForce RTX 4080",
        "color": "Dark Gray",
        "price": 4799.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/MSIGE77RaiderHX12UHS-1.webp",
            "photoTwo": "/images/MSIGE77RaiderHX12UHS-2.webp",
            "photoThree": "/images/MSIGE77RaiderHX12UHS-3.webp",
            "photoFour": "/images/MSIGE77RaiderHX12UHS-4.webp"
        },
        "description": "Experience unparalleled performance with the 12th Gen. Intel Core i7 processor, delivering maximum efficiency for gaming, multitasking, and productivity. The keyboard layout follows the familiar qwerty design, ensuring user-friendly input. Stay up-to-date with the all-new Windows 11 Pro, ideal for both home use and business operations. Dive into the world of realistic ray-traced graphics and cutting-edge AI features, courtesy of the NVIDIA GeForce RTX 3070 Ti GPU, powered by the 2nd gen RTX architecture. The 17.3' 240Hz QHD display, boasting a DCI-P3 100% color gamut, elevates gaming visuals with vibrant colors and intricate details. Thunderbolt 4 and DDR5-4800 memory contribute to high-speed data transfer, ensuring unparalleled system speed and responsiveness for an immersive computing experience."
    },
    {
        "productName": "Xiaomi PB3 30 000 mAh",
        "category": "Powerbanks",
        "capacity": 30000,
        "company": "Xiaomi",
        "color": "White",
        "price": 42.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/XiaomiPB330000mAh(White)PB3018ZM-1.webp",
            "photoTwo": "/images/XiaomiPB330000mAh(White)PB3018ZM-2.webp",
            "photoThree": "/images/XiaomiPB330000mAh(White)PB3018ZM-3.webp",
            "photoFour": "/images/XiaomiPB330000mAh(White)PB3018ZM-4.webp"
        },
        "description": "Mi Power bank 3 PB3018ZM, Xiaomi's inaugural external battery, boasts a substantial 30000mAh capacity. Featuring 3 output interfaces – 2 x USB-A and 1 x USB-C – it enables the simultaneous charging of three devices. Both USB-A and USB-C interfaces support rapid charging at a maximum of 18W. The power bank is equipped with two input interfaces, micro-USB, and USB-C, with the latter supporting high input power of up to 24W. Compatible with smartphones, tablets, cameras, and smaller smart devices like fitness bracelets or Bluetooth headsets, this model is versatile. Crafted from premium materials, including polycarbonate and ABS plastic, the Xiaomi Power Bank 3 ensures durability, scratch resistance, and a comfortable tactile feel. Additionally, it features an anti-slip coating and compact dimensions for convenient portability."
    },
    {
        "productName": "Lenovo Go USB-C Laptop Power Bank 20000",
        "category": "Powerbanks",
        "capacity": 20000,
        "company": "Lenovo",
        "color": "Grey",
        "price": 139.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/LenovoGoUSB-CLaptopPowerBank20000-1.webp",
            "photoTwo": "/images/LenovoGoUSB-CLaptopPowerBank20000-2.webp",
            "photoThree": "/images/LenovoGoUSB-CLaptopPowerBank20000-3.webp",
            "photoFour": "/images/LenovoGoUSB-CLaptopPowerBank20000-4.webp"
        },
        "description": "Wires are like chains for remote workers. That's why we've eliminated cables and introduced a truly wireless portable power bank. With a 10,000mAh battery and Qi wireless connectivity, one power source is all you need to deliver up to 15W of wireless power to your Qi-enabled devices. Features include a 10,000mAh capacity, max 30W output, simultaneous charging for up to 3 devices, dual USB-C connections, including 1 built-in USB-C cable, support for fast USB-C charging for tablets (up to 27W), and Qi wireless fast charging up to 15W. It's compatible with PD 3.0 devices, supports pass-through charging, and provides fast charging with any USB-C adapter, completing a full charge in under 2 hours. With built-in protection against overcharging and safety features, this wireless power bank redefines convenience and efficiency for your charging needs."
    },
    {
        "productName": "Valve Steam Deck 512GB",
        "category": "Game-Consoles",
        "company": "Valve",
        "storage": 512,
        "price": 899.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/ValveSteamDeck512GB-1.webp",
            "photoTwo": "/images/ValveSteamDeck512GB-2.webp",
            "photoThree": "/images/ValveSteamDeck512GB-3.webp",
            "photoFour": "/images/ValveSteamDeck512GB-4.webp"
        },
        "description": "The Steam Deck, launched on February 25, 2022, represents Valve's venture into the handheld gaming computer market. Powered by Valve's Linux-based SteamOS, integrating the renowned Steam storefront, the device introduces versatility through the use of Valve's Proton compatibility layer. This feature enables users to run Windows applications and games seamlessly. Beyond its handheld functionality, the Steam Deck offers the flexibility of being connected to a TV or monitor via a docking station, transforming it into a desktop computer or a home video game console. This dual-purpose design caters to diverse gaming preferences. In desktop mode, users gain the ability to install Linux-based third-party applications, expanding the device's utility beyond gaming. With its innovative approach, the Steam Deck aims to redefine portable gaming experiences and adaptability within the gaming ecosystem."
    },
    {
        "productName": "Valve Steam Deck 256GB",
        "category": "Game-Consoles",
        "company": "Valve",
        "storage": 256,
        "price": 799.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/ValveSteamDeck512GB-1.webp",
            "photoTwo": "/images/ValveSteamDeck512GB-2.webp",
            "photoThree": "/images/ValveSteamDeck512GB-3.webp",
            "photoFour": "/images/ValveSteamDeck512GB-4.webp"
        },
        "description": "The Steam Deck, launched on February 25, 2022, represents Valve's venture into the handheld gaming computer market. Powered by Valve's Linux-based SteamOS, integrating the renowned Steam storefront, the device introduces versatility through the use of Valve's Proton compatibility layer. This feature enables users to run Windows applications and games seamlessly. Beyond its handheld functionality, the Steam Deck offers the flexibility of being connected to a TV or monitor via a docking station, transforming it into a desktop computer or a home video game console. This dual-purpose design caters to diverse gaming preferences. In desktop mode, users gain the ability to install Linux-based third-party applications, expanding the device's utility beyond gaming. With its innovative approach, the Steam Deck aims to redefine portable gaming experiences and adaptability within the gaming ecosystem."
    },
    {
        "productName": "Valve Steam Deck 128GB",
        "category": "Game-Consoles",
        "company": "Valve",
        "storage": 128,
        "price": 699.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/ValveSteamDeck512GB-1.webp",
            "photoTwo": "/images/ValveSteamDeck512GB-2.webp",
            "photoThree": "/images/ValveSteamDeck512GB-3.webp",
            "photoFour": "/images/ValveSteamDeck512GB-4.webp"
        },
        "description": "The Steam Deck, launched on February 25, 2022, represents Valve's venture into the handheld gaming computer market. Powered by Valve's Linux-based SteamOS, integrating the renowned Steam storefront, the device introduces versatility through the use of Valve's Proton compatibility layer. This feature enables users to run Windows applications and games seamlessly. Beyond its handheld functionality, the Steam Deck offers the flexibility of being connected to a TV or monitor via a docking station, transforming it into a desktop computer or a home video game console. This dual-purpose design caters to diverse gaming preferences. In desktop mode, users gain the ability to install Linux-based third-party applications, expanding the device's utility beyond gaming. With its innovative approach, the Steam Deck aims to redefine portable gaming experiences and adaptability within the gaming ecosystem."
    },
    {
        "productName": "ASUS ROG Ally",
        "category": "Game-Consoles",
        "company": "Asus",
        "storage": 512,
        "price": 799.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/ASUSROGAlly-1.webp",
            "photoTwo": "/images/ASUSROGAlly-2.webp",
            "photoThree": "/images/ASUSROGAlly-3.webp",
            "photoFour": "/images/ASUSROGAlly-4.webp"
        },
        "description": "The Asus ROG Ally, introduced on June 13, 2023, stands as a formidable handheld gaming computer within Asus's Republic of Gamers lineup, directly competing with Valve's Steam Deck. Running on the Windows 11 operating system and fueled by an AMD Zen 4 processor, the ROG Ally offers a versatile gaming experience. In addition to its handheld functionality, the device seamlessly transforms into a desktop computer or a home video game console when connected to a TV or monitor through a docking station. The ROG Ally incorporates an AMD APU based on Zen 4 and RDNA 3 architectures, with two models featuring the Ryzen Z1 processor and Ryzen Z1 Extreme processor, offering varying core/thread configurations and impressive GPU performance. The handheld unit boasts a 7-inch touchscreen LCD display with a 1080p resolution and a variable refresh rate up to 120Hz, coupled with intuitive controls reminiscent of an Xbox Wireless Controller for a comfortable and immersive gaming experience. The inclusion of variable timing frequencies in the processors adds an extra layer of flexibility, catering to diverse gaming needs. With its powerful hardware and adaptable design, the Asus ROG Ally is poised to deliver a cutting-edge gaming experience in various settings."
    },
    {
        "productName": "The Elder Scrolls V: Skyrim Nintendo Switch Version",
        "category": "Games",
        "company": "Bethesda",
        "platform": "Nintendo Switch",
        "price": 49.99,
        "inStock": true,
        "genre": "RPG",
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/TheElderScrollsVSkyrimNintendo-1.webp",
            "photoTwo": "/images/TheElderScrollsVSkyrimNintendo-2.webp",
            "photoThree": "/images/TheElderScrollsVSkyrimNintendo-3.webp",
            "photoFour": "/images/TheElderScrollsVSkyrimNintendo-4.webp"
        },
        "description": "The Elder Scrolls V: Skyrim, developed by Bethesda Game Studios, is an epic open-world action role-playing game set in the fantasy realm of Tamriel. Released in November 2011, it quickly became a landmark title known for its vast and immersive world. Players assume the role of the Dragonborn, a hero prophesied to save the world from a dragon apocalypse. The game offers unparalleled freedom, allowing players to explore the expansive landscapes, engage in dynamic quests, and shape their character's destiny. With a rich narrative, detailed lore, and a vast array of skills and abilities to master, Skyrim has earned acclaim for its depth and player-driven storytelling. The game's success has led to multiple re-releases on various platforms, solidifying its status as a modern classic in the RPG genre."
    },
    {
        "productName": "Apple Watch ULTRA 2 49mm",
        "size": "49mm",
        "resolution": "502 x 410",
        "category": "Smartwatches",
        "company": "Apple",
        "price": 799.99,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AppleWatchULTRA249mm-1.webp",
            "photoTwo": "/images/AppleWatchULTRA249mm-2.webp",
            "photoThree": "/images/AppleWatchULTRA249mm-3.webp"
        },
        "description": "The Apple Watch Ultra 2 is designed for rugged durability and meets the demands of endurance athletes, outdoor enthusiasts, and water sports aficionados, offering specialized straps for each activity. Powered by the S9 SiP, it features a super-bright Always-On Retina display with a touchless interaction method, providing up to 36 hours of battery life and 72 hours in Low Power Mode. Carbon neutral when paired with the latest Alpine Loop or Trail Loop, this watch boasts a 49mm corrosion-resistant titanium case, a Large Digital Crown, and a customizable Action button for instant control. With 100m water resistance and Apple's brightest display yet, it allows easy viewing even in harsh sunlight, accommodating more complications on the watch face and displaying six metrics simultaneously. Built-in cellular capabilities enable calling, texting, streaming music, and getting directions without an iPhone. Tailored for athletes, it offers advanced metrics and workout views, while outdoor adventurers benefit from the Compass app, GPS features, and the rugged Alpine Loop band. The Apple Watch Ultra 2 seamlessly combines cutting-edge technology with robust design for those seeking peak performance in various activities."
    },
    {
        "productName": "Apple Watch Series 9 45mm",
        "size": "45mm",
        "resolution": "396 x 484",
        "category": "Smartwatches",
        "company": "Apple",
        "price": 549.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AppleWatchSeries945mm-1.webp",
            "photoTwo": "/images/AppleWatchSeries945mm-2.webp",
            "photoThree": "/images/AppleWatchSeries945mm-3.webp",
            "photoFour": "/images/AppleWatchSeries945mm-4.webp"
        },
        "description": "The Apple Watch Series 9 emerges as an essential companion for a healthy lifestyle, now empowered by the S9 chip for a super-bright display and innovative touchless interactions. Carbon-neutral when paired with the latest Sport Loop, this aluminum watch embodies Apple's commitment to environmental sustainability. It introduces advanced health features, including blood oxygen monitoring, ECG capabilities, notifications for irregular heart rhythms, and detailed insights into sleep stages and overall well-being. As a powerful fitness partner, the Workout app offers diverse training options and advanced metrics, accompanied by a complimentary three-month subscription to Apple Fitness+. The watch prioritizes safety with features like Fall Detection, Crash Detection, and Emergency SOS, ensuring a prompt response in emergencies. Seamless compatibility with Apple devices and services enables convenient functionalities such as unlocking a Mac, Precision Finding to locate an iPhone, and secure payments with Apple Pay. The Apple Watch Series 9 is easily customizable with a variety of watch bands, styles, materials, and colors, along with fully customizable watch faces, allowing users to personalize their watch to suit any mood or occasion."
    },
    {
        "productName": "Apple iPhone 15 Pro Max 256GB Natural Titanium",
        "category": "Smartphones",
        "company": "Apple",
        "storage": 256,
        "cpu": "Apple A17 Bionic",
        "color": "Natural Titanium",
        "price": 1399,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AppleiPhone15ProMax256GB-1.webp",
            "photoTwo": "/images/AppleiPhone15ProMax256GB-2.webp",
            "photoThree": "/images/AppleiPhone15ProMax256GB-3.webp",
            "photoFour": "/images/AppleiPhone15ProMax256GB-4.webp",
            "photoFive": "/images/AppleiPhone15ProMax256GB-5.webp"
        },
        "description": "The Apple iPhone 15 Pro Max in Blue Titanium emerges as the pinnacle of technological excellence in the 2023 lineup. Boasting a ProMotion display with a 120Hz refresh rate and a 6.7-inch diagonal, this flagship device showcases a range of cutting-edge features. Powered by the A17 Pro processor, crafted on a 3-nanometer process, it delivers unparalleled performance. The triple rear camera system, titanium frames, and toughened glass back panel contribute to a sleek and durable design. Running on the iOS 17 operating system, this iPhone introduces advancements in health features, a powerful fitness partner, and innovative safety elements like Fall Detection and Crash Detection. With carbon-neutral options and expanded storage capacities, including up to 1TB, the iPhone 15 Pro Max offers a comprehensive and groundbreaking smartphone experience for tech enthusiasts and Apple aficionados alike."
    },
    {
        "productName": "Apple iPhone 15 Pro Max 512GB Natural Titanium",
        "category": "Smartphones",
        "company": "Apple",
        "storage": 512,
        "cpu": "Apple A17 Bionic",
        "color": "Natural Titanium",
        "price": 1499,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AppleiPhone15ProMax256GB-1.webp",
            "photoTwo": "/images/AppleiPhone15ProMax256GB-2.webp",
            "photoThree": "/images/AppleiPhone15ProMax256GB-3.webp",
            "photoFour": "/images/AppleiPhone15ProMax256GB-4.webp",
            "photoFive": "/images/AppleiPhone15ProMax256GB-5.webp"
        },
        "description": "The Apple iPhone 15 Pro Max in Blue Titanium emerges as the pinnacle of technological excellence in the 2023 lineup. Boasting a ProMotion display with a 120Hz refresh rate and a 6.7-inch diagonal, this flagship device showcases a range of cutting-edge features. Powered by the A17 Pro processor, crafted on a 3-nanometer process, it delivers unparalleled performance. The triple rear camera system, titanium frames, and toughened glass back panel contribute to a sleek and durable design. Running on the iOS 17 operating system, this iPhone introduces advancements in health features, a powerful fitness partner, and innovative safety elements like Fall Detection and Crash Detection. With carbon-neutral options and expanded storage capacities, including up to 1TB, the iPhone 15 Pro Max offers a comprehensive and groundbreaking smartphone experience for tech enthusiasts and Apple aficionados alike."
    },
    {
        "productName": "Apple iPhone 15 Plus 512GB Black",
        "category": "Smartphones",
        "company": "Apple",
        "storage": 512,
        "cpu": "Apple A16 Bionic",
        "color": "Natural Titanium",
        "price": 1399,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AppleiPhone15Plus512GBBlack-1.webp",
            "photoTwo": "/images/AppleiPhone15Plus512GBBlack-2.webp",
            "photoThree": "/images/AppleiPhone15Plus512GBBlack-3.webp"
        },
        "description": "Introducing the iPhone 15 Plus with an all-inclusive package featuring unlimited talk, text, and data on America's Smart Network. Seamlessly transition to the latest iPhone each year without the need for trade-ins. Experience the innovative Dynamic Island feature that bubbles up alerts and Live Activities, ensuring you stay informed even while engaged in other tasks. The iPhone 15 Plus boasts a durable color-infused glass and aluminum design, with splash, water, and dust resistance. The Ceramic Shield front enhances durability, and the 6.7' Super Retina XDR display offers enhanced brightness, up to 2x in sunlight compared to the iPhone 14. Capture stunning photos with the 48MP Main camera and 2x optical-quality Telephoto, while next-generation portraits allow for dynamic focus shifting. Powered by the A16 Bionic chip, the iPhone 15 Plus supports advanced features, computational photography, fluid Dynamic Island transitions, and Voice Isolation for calls, all with excellent all-day battery life. Benefit from unlimited wireless connectivity across America's Smart Network, harnessing the combined strength of three 5G networks for unparalleled nationwide coverage."
    },
    {
        "productName": "Apple iPhone 15 Plus 256GB Black",
        "category": "Smartphones",
        "company": "Apple",
        "storage": 256,
        "cpu": "Apple A16 Bionic",
        "color": "Natural Titanium",
        "price": 1299,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AppleiPhone15Plus512GBBlack-1.webp",
            "photoTwo": "/images/AppleiPhone15Plus512GBBlack-2.webp",
            "photoThree": "/images/AppleiPhone15Plus512GBBlack-3.webp"
        },
        "description": "Introducing the iPhone 15 Plus with an all-inclusive package featuring unlimited talk, text, and data on America's Smart Network. Seamlessly transition to the latest iPhone each year without the need for trade-ins. Experience the innovative Dynamic Island feature that bubbles up alerts and Live Activities, ensuring you stay informed even while engaged in other tasks. The iPhone 15 Plus boasts a durable color-infused glass and aluminum design, with splash, water, and dust resistance. The Ceramic Shield front enhances durability, and the 6.7' Super Retina XDR display offers enhanced brightness, up to 2x in sunlight compared to the iPhone 14. Capture stunning photos with the 48MP Main camera and 2x optical-quality Telephoto, while next-generation portraits allow for dynamic focus shifting. Powered by the A16 Bionic chip, the iPhone 15 Plus supports advanced features, computational photography, fluid Dynamic Island transitions, and Voice Isolation for calls, all with excellent all-day battery life. Benefit from unlimited wireless connectivity across America's Smart Network, harnessing the combined strength of three 5G networks for unparalleled nationwide coverage."
    },
    {
        "productName": "Apple iPad Pro 12.9 512GB M2 Wi-Fi Silver 2022",
        "category": "Tablets",
        "company": "Apple",
        "diagonal": 12.9,
        "resolution": "2732 x 2048",
        "storage": 512,
        "cpu": "Apple M2",
        "color": "Silver",
        "price": 1499,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AppleiPadPro12.9512GBM2WiFiSilver-1.webp",
            "photoTwo": "/images/AppleiPadPro12.9512GBM2WiFiSilver-2.webp",
            "photoThree": "/images/AppleiPadPro12.9512GBM2WiFiSilver-3.webp",
            "photoFour": "/images/AppleiPadPro12.9512GBM2WiFiSilver-4.webp"
        },
        "description": "The iPad Pro offers the pinnacle of the iPad experience, featuring the remarkable performance of the M2 chip, rapid wireless connectivity, and an enhanced Apple Pencil experience. With iPadOS, enjoy heightened productivity, multitasking capabilities, and seamless interactions with apps like Safari, Messages, and Keynote, among a vast selection from the App Store. Benefit from Wi-Fi 6E for swift wireless connections, enabling efficient work from various locations with quick file transfers. The M2 chip's 8-core CPU and 10-core GPU deliver robust performance, complemented by all-day battery life and up to 2 terabytes of storage. Apple Pencil (2nd generation) transforms the iPad Pro into a premier drawing canvas and note-taking device, while the Magic Keyboard provides an excellent typing experience and built-in trackpad. The 12.9-inch Liquid Retina XDR display boasts stunning brightness, contrast ratio, and advanced technologies, perfect for HDR content, entertainment, and gaming. Face ID ensures secure unlocking, authentication, and more, all with a simple glance. Accessories like the Apple Pencil and Magic Keyboard are sold separately, enhancing the overall iPad Pro experience."
    },
    {
        "productName": "Xiaomi 20 000mAh 50W",
        "capacity": 20000,
        "category": "Powerbanks",
        "company": "Xiaomi",
        "color": "Black",
        "price": 49.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/Xiaomi20000mAh50W-1.webp",
            "photoTwo": "/images/Xiaomi20000mAh50W-2.webp",
            "photoThree": "/images/Xiaomi20000mAh50W-3.webp",
            "photoFour": "/images/Xiaomi20000mAh50W-4.webp"
        },
        "description": "Xiaomi Mi 50W Power Bank 20000mAh Black (BHR5121GL) is a high-capacity and high-power external battery with a sleek and sophisticated design, making it a versatile accessory for various devices. Equipped with Li-Ion power cells totaling a capacity of 20000mAh, this power bank can deliver power up to 50W, enabling fast charging for smartphones, tablets, and compatible laptops. The device features USB and USB Type-C interfaces for connection and charging. Users can easily check the remaining battery level through the LED indicator. With its robust design and impressive power output, the Xiaomi Mi 50W Power Bank is a reliable solution for on-the-go charging needs."
    },
    {
        "productName": "Horizon Forbidden West PS4",
        "category": "Games",
        "company": "Sony Interactive Entertainment",
        "platform": "PlayStation 4",
        "price": 49.99,
        "inStock": true,
        "genre": "RPG/Action",
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/HORIZONZERODAWNFORBIDDENWESTps4-1.webp",
            "photoTwo": "/images/HORIZONZERODAWNFORBIDDENWESTps4-2.webp",
            "photoThree": "/images/HORIZONZERODAWNFORBIDDENWESTps4-3.webp"
        },
        "description": "Horizon Forbidden West, the 2022 action role-playing game developed by Guerrilla Games and published by Sony Interactive Entertainment, continues the narrative set by its predecessor, Horizon Zero Dawn. Launched on February 18, 2022, for PlayStation 4 and PlayStation 5, the game unfolds in a post-apocalyptic rendition of the Western United States, grappling with the aftermath of an extinction event triggered by a rogue robot swarm. Players navigate the open world, engaging in quests and combatting hostile machine creatures using a variety of ranged and melee weapons. Garnering generally positive reviews from critics, Horizon Forbidden West had sold over 8.4 million units by April 2023. An expansion titled Burning Shores was released for the PlayStation 5 version on April 19, 2023. The game and its expansion were bundled as Horizon Forbidden West - Complete Edition for PlayStation 5 on October 6, 2023, with a Windows release anticipated in early 2024."
    },
    {
        "productName": "Horizon Forbidden West PS5",
        "category": "Games",
        "company": "Sony Interactive Entertainment",
        "platform": "PlayStation 5",
        "price": 49.99,
        "inStock": true,
        "genre": "RPG/Action",
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/HORIZONZERODAWNFORBIDDENWESTps5-1.webp",
            "photoTwo": "/images/HORIZONZERODAWNFORBIDDENWESTps5-2.webp",
            "photoThree": "/images/HORIZONZERODAWNFORBIDDENWESTps5-3.webp"
        },
        "description": "Horizon Forbidden West, the 2022 action role-playing game developed by Guerrilla Games and published by Sony Interactive Entertainment, continues the narrative set by its predecessor, Horizon Zero Dawn. Launched on February 18, 2022, for PlayStation 4 and PlayStation 5, the game unfolds in a post-apocalyptic rendition of the Western United States, grappling with the aftermath of an extinction event triggered by a rogue robot swarm. Players navigate the open world, engaging in quests and combatting hostile machine creatures using a variety of ranged and melee weapons. Garnering generally positive reviews from critics, Horizon Forbidden West had sold over 8.4 million units by April 2023. An expansion titled Burning Shores was released for the PlayStation 5 version on April 19, 2023. The game and its expansion were bundled as Horizon Forbidden West - Complete Edition for PlayStation 5 on October 6, 2023, with a Windows release anticipated in early 2024."
    },
    {
        "productName": "Uncharted: Legacy of Thieves Collection",
        "category": "Games",
        "company": "Sony Interactive Entertainment",
        "platform": "PlayStation 5",
        "price": 49.99,
        "inStock": true,
        "genre": "Action",
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/UnchartedLegacyofThievesCollectionps5-1.webp",
            "photoTwo": "/images/UnchartedLegacyofThievesCollectionps5-2.webp",
            "photoThree": "/images/UnchartedLegacyofThievesCollectionps5-3.webp"
        },
        "description": "Embark on a thrilling pursuit of your own legacy and make your mark on the map in UNCHARTED: Legacy of Thieves Collection. Immerse yourself in the cinematic narratives crafted by Naughty Dog and the acclaimed games from the iconic franchise. Rediscover forgotten legends alongside charismatic and profound characters Nathan Drake and Chloe Frazer, as they traverse the globe in search of exhilarating adventures and lost knowledge. The collection includes critically acclaimed and globally renowned single-player campaigns from UNCHARTED 4: A Thief's End and UNCHARTED: The Lost Legacy, enhanced with stunning details for the PS5™ console, featuring improved graphics and increased frame rates."
    },
    {
        "productName": "Hogwarts Legacy Deluxe Edition",
        "category": "Games",
        "company": "Avalanche",
        "platform": "Xbox Series X",
        "price": 49.99,
        "inStock": true,
        "genre": "Action",
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/HogwartsLegacyDeluxeEditionXboxX-1.webp",
            "photoTwo": "/images/HogwartsLegacyDeluxeEditionXboxX-2.webp"
        },
        "description": "Hogwarts Legacy is a third-person role-playing action game developed by Avalanche Software and published by Warner Bros. Interactive Entertainment under the Portkey Games label. Released in February 2023 for Microsoft Windows, PlayStation 5, and Xbox Series X/S, with versions for PlayStation 4 and Xbox One on May 5, and Nintendo Switch on November 14. Set in the late 19th century in the Wizarding World, the narrative follows the adventures of a student at Hogwarts. The gameplay involves third-person control, allowing players to customize their protagonist's voice, appearance, and gender, and choose a house at the beginning. Throughout the game, players undertake both main and side quests, customize gameplay difficulty, learn new spells and abilities, brew potions, and tame magical creatures. The open-world environment provides equipment for character enhancement, and players can summon a broom or tamed creatures for faster travel. The game received generally favorable reviews, praised for its immersive Wizarding World experience and engaging gameplay mechanics."
    },
    {
        "productName": "Dead Space",
        "category": "Games",
        "company": "Electronic Arts",
        "platform": "Xbox Series X",
        "price": 59.99,
        "inStock": true,
        "genre": "Horror",
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/DeadSpace2023XboxX-1.webp",
            "photoTwo": "/images/DeadSpace2023XboxX-2.webp",
            "photoThree": "/images/DeadSpace2023XboxX-3.webp"
        },
        "description": "Dead Space, released in 2023, is a survival horror game meticulously crafted by Motive Studio and published by Electronic Arts. This game serves as a remake of the 2008 title with the same name developed by EA Redwood Shores. Available on PlayStation 5, Windows, and Xbox Series X/S since January 27, 2023, it marks the return of the Dead Space series, which had been dormant since the release of Dead Space 3 in 2013. True to the narrative of its predecessor, the game unfolds on a mining spaceship infested with lethal creatures known as Necromorphs, triggered by the discovery of an ominous artifact called the Marker. Players take command of engineer Isaac Clarke, maneuvering through the spacecraft, battling Necromorphs, and grappling with encroaching psychosis, delivering an intense and terrifying gaming experience."
    },
    {
        "productName": "Ghostrunner",
        "category": "Games",
        "company": "505 Games",
        "platform": "Xbox Series X",
        "price": 39.99,
        "inStock": true,
        "genre": "Action",
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/GhostrunnerXboxSeriesX-1.webp",
            "photoTwo": "/images/GhostrunnerXboxSeriesX-2.webp",
            "photoThree": "/images/GhostrunnerXboxSeriesX-3.webp"
        },
        "description": "Ghostrunner, a collaborative creation of One More Level and Slipgate Ironworks, is a cyberpunk platformer offering a challenging gaming experience. Released across various platforms, including Microsoft Windows, PlayStation, Xbox, and Nintendo Switch, it combines fast-paced parkour movements with intense combat against deadly enemies. Players take on the role of Jack Ghostrunner, navigating treacherous environments using acrobatic skills and engaging enemies with precision. The game features a unique mechanic called Sensory Boost, allowing Jack to manipulate time and evade bullets creatively. As players progress through the story, they unlock new abilities and enhancements, enhancing their cybernetic prowess in a futuristic dystopian world. Ghostrunner received positive acclaim for its engaging gameplay and stylish cyberpunk aesthetics."
    },
    {
        "productName": "Demons Souls Remake",
        "category": "Games",
        "company": "Sony Interactive Entertainment",
        "platform": "PlayStation 5",
        "price": 49.99,
        "inStock": true,
        "genre": "RPG",
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/DemonsSoulsRemake-1.webp",
            "photoTwo": "/images/DemonsSoulsRemake-2.webp",
            "photoThree": "/images/DemonsSoulsRemake-3.webp"
        },
        "description": "Demon's Souls Remake is a action role-playing game developed by Bluepoint Games and Japan Studio, published by Sony Interactive Entertainment. Released as a remake of the original Demon's Souls, the game is exclusive to the PlayStation 5 and was launched alongside the console on November 12, 2020. As a ground-up recreation, the Demon's Souls Remake features updated graphics, revamped audio, and redesigned gameplay mechanics while staying true to the challenging and atmospheric nature of the 2009 original. The game is set in the dark fantasy kingdom of Boletaria, where players take on the role of a hero on a quest to defeat powerful demons and save the kingdom. The Demon's Souls Remake received widespread critical acclaim for its stunning visuals, faithful recreation of the source material, and its contribution to the launch library of the PlayStation 5."
    },
    {
        "productName": "The Last Of Us Part I",
        "category": "Games",
        "company": "Sony Interactive Entertainment",
        "platform": "PlayStation 5",
        "price": 59.99,
        "inStock": true,
        "genre": "Action",
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/TheLastOfUsPartI-1.webp",
            "photoTwo": "/images/TheLastOfUsPartI-2.webp",
            "photoThree": "/images/TheLastOfUsPartI-3.webp"
        },
        "description": "The Last of Us Part I is an action-adventure game developed by Naughty Dog and published by Sony Computer Entertainment. Initially released for the PlayStation 3 on June 14, 2013, the game was later remastered for the PlayStation 4. Set in a post-apocalyptic world, The Last of Us follows Joel, a smuggler, and Ellie, a young girl with unique immunity to a devastating infection, as they embark on a perilous journey across the United States. The game blends intense survival and stealth elements with a compelling narrative, exploring themes of loss, survival, and the complexity of human relationships. Praised for its storytelling, character development, and atmospheric design, The Last of Us became a critical and commercial success, receiving numerous awards and accolades."
    },
    {
        "productName": "HUAWEI WATCH GT 4 41mm",
        "size": "41mm",
        "resolution": "466 × 466",
        "category": "Smartwatches",
        "company": "HUAWEI",
        "price": 219.99,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/HUAWEIWATCHGT441mm-1.webp",
            "photoTwo": "/images/HUAWEIWATCHGT441mm-2.webp",
            "photoThree": "/images/HUAWEIWATCHGT441mm-3.webp",
            "photoFour": "/images/HUAWEIWATCHGT441mm-4.webp"
        },
        "description": "The HUAWEI WATCH GT 4 in the 41mm size is a sophisticated smartwatch that combines style with advanced features. The watch features a 1.43-inch AMOLED display, delivering vibrant and detailed visuals. With a lightweight design and a variety of stylish watch faces, it offers a fashionable accessory for any occasion. The GT 4 is equipped with a range of health and fitness tracking capabilities, including heart rate monitoring, sleep tracking, stress analysis, and SpO2 measurement. It supports multiple workout modes, providing comprehensive data for various activities. The smartwatch integrates seamlessly with your smartphone, allowing you to receive notifications and control music directly from your wrist. The HUAWEI WATCH GT 4 also boasts a long-lasting battery life, ensuring extended usage without frequent charging. With water resistance, it is suitable for everyday wear and fitness activities. Overall, the HUAWEI WATCH GT 4 41mm is a versatile and stylish smartwatch designed to enhance both your fashion and lifestyle."
    },
    {
        "productName": "Samsung Galaxy Watch6 40mm",
        "size": "40mm",
        "resolution": "432 x 432",
        "category": "Smartwatches",
        "company": "Samsung",
        "price": 239.99,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/SamsungGalaxyWatch640mm-1.webp",
            "photoTwo": "/images/SamsungGalaxyWatch640mm-2.webp",
            "photoThree": "/images/SamsungGalaxyWatch640mm-3.webp"
        },
        "description": "The Samsung Galaxy Watch6 40mm is a compact and stylish smartwatch that packs a range of advanced features. With a sleek 40mm design, it offers a comfortable and lightweight fit on the wrist. The watch features a vibrant AMOLED display with a high resolution, providing clear and vivid visuals. Powered by advanced health sensors, it offers comprehensive fitness and health tracking, including heart rate monitoring, sleep analysis, and SpO2 measurement. The watch supports various workout modes, making it suitable for different physical activities. With water resistance, it can be worn during swimming sessions. The Galaxy Watch6 also offers smart functionalities such as notifications, app integration, and customizable watch faces. Equipped with a reliable battery, it ensures extended usage on a single charge. Overall, the Samsung Galaxy Watch6 40mm combines style with powerful features, making it a versatile and attractive smartwatch option."
    },
    {
        "productName": "Samsung Galaxy Watch5 Pro 45 mm",
        "size": "45mm",
        "resolution": "450 х 450",
        "category": "Smartwatches",
        "company": "Samsung",
        "price": 339.99,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/SamsungGalaxyWatch5Pro45mm-1.webp",
            "photoTwo": "/images/SamsungGalaxyWatch5Pro45mm-2.webp",
            "photoThree": "/images/SamsungGalaxyWatch5Pro45mm-3.webp",
            "photoFour": "/images/SamsungGalaxyWatch5Pro45mm-4.webp"
        },
        "description": "The Samsung Galaxy Watch5 Pro 45 mm is a premium smartwatch designed to provide a sophisticated and feature-rich experience. With a 45 mm watch face, it offers a bold and stylish look suitable for various occasions. The watch features a vivid AMOLED display with a high resolution, delivering clear and vibrant visuals. Powered by advanced health-tracking sensors, it offers comprehensive fitness and health monitoring, including heart rate tracking, sleep analysis, and SpO2 measurement. The watch supports a variety of workout modes to cater to different fitness activities. With water resistance, it can be worn during swimming sessions. The Galaxy Watch5 Pro also offers smart functionalities such as notifications, app integration, and customizable watch faces. Equipped with a durable battery, it ensures extended usage on a single charge. Overall, the Samsung Galaxy Watch5 Pro combines elegance with advanced technology, making it a versatile and premium smartwatch option."
    },
    {
        "productName": "Amazfit GTS 4 Mini 20mm",
        "size": "20mm",
        "resolution": "336 x 384",
        "category": "Smartwatches",
        "company": "Amazfit",
        "price": 99.99,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AmazfitGTS4Mini-1.webp",
            "photoTwo": "/images/AmazfitGTS4Mini-2.webp",
            "photoThree": "/images/AmazfitGTS4Mini-3.webp",
            "photoFour": "/images/AmazfitGTS4Mini-4.webp"
        },
        "description": "The Amazfit GTS 4 Mini is a compact and stylish smartwatch designed to enhance your active lifestyle. With a lightweight and slim profile, it offers comfort for all-day wear. The device features a vibrant AMOLED display that provides clear visuals and supports customizable watch faces to suit your style. Packed with fitness and health-tracking capabilities, the GTS 4 Mini offers over 70 sports modes, heart rate monitoring, sleep analysis, and SpO2 measurement. The built-in BioTracker 4.0 sensor ensures accurate health data tracking. With water resistance, it can accompany you during swim sessions. The watch supports smart features like notifications, music control, and voice commands. With a long battery life, the Amazfit GTS 4 Mini is a versatile companion for those looking to stay active and connected throughout the day."
    },
    {
        "productName": "Samsung Galaxy Watch4 44 mm",
        "size": "36mm",
        "resolution": "450 х 450",
        "category": "Smartwatches",
        "company": "Samsung",
        "price": 219.99,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/SamsungGalaxyWatch444mm-1.webp",
            "photoTwo": "/images/SamsungGalaxyWatch444mm-2.webp",
            "photoThree": "/images/SamsungGalaxyWatch444mm-3.webp",
            "photoFour": "/images/SamsungGalaxyWatch444mm-4.webp"
        },
        "description": "The Samsung Galaxy Watch4 44 mm combines style and advanced functionality, featuring a sleek design and a 1.4-inch Super AMOLED display with vibrant colors and crisp visuals. Powered by the Wear OS, the smartwatch provides seamless integration with Android devices and offers a variety of health and fitness features. Equipped with Samsung's BioActive Sensor, it enables accurate tracking of health metrics like heart rate, blood oxygen, and body composition. The watch supports multiple workout modes, providing real-time feedback and insights to enhance fitness routines. With the option for cellular connectivity, users can stay connected on the go, receive notifications, and even make calls directly from the watch. The Galaxy Watch4 44 mm combines style, health tracking, and smartwatch capabilities, making it a versatile companion for daily life and fitness enthusiasts."
    },
    {
        "productName": "Amazfit GTS 4",
        "size": "38mm",
        "resolution": "390 x 450",
        "category": "Smartwatches",
        "company": "Samsung",
        "price": 149.99,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AmazfitGTS4-1.webp",
            "photoTwo": "/images/AmazfitGTS4-2.webp",
            "photoThree": "/images/AmazfitGTS4-3.webp",
            "photoFour": "/images/AmazfitGTS4-4.webp"
        },
        "description": "Amazfit GTS 4 offers a sophisticated smart fitness experience with its diverse range of over 150 physical activity modes, including walking, yoga, running, cycling, and swimming. Its dual-frequency positioning system ensures accurate GPS coordination, allowing users to import routes for precise navigation. The slim and stylish design, featuring a 1.75' vibrant AMOLED display with 30 animated and 4 interactive watch faces, enhances both aesthetics and functionality. The device, weighing only 27g and with a thickness of 9.9mm, incorporates the BioTracker 4.0 sensor for comprehensive health monitoring, including heart rate, stress levels, blood oxygen, and sleep patterns. With voice assistant support, including Alexa, and an energy-efficient battery offering up to 16 days in energy-saving mode, Amazfit GTS 4 provides an optimal blend of style, functionality, and health tracking for users seeking a smart fitness companion."
    },
    {
        "productName": "Michael Kors Gen 6 44 mm",
        "size": "44mm",
        "resolution": "416 x 416",
        "category": "Smartwatches",
        "company": "Michael Cors",
        "price": 279.99,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/MichaelKorsGen644mm-1.webp",
            "photoTwo": "/images/MichaelKorsGen644mm-2.webp",
            "photoThree": "/images/MichaelKorsGen644mm-3.webp",
            "photoFour": "/images/MichaelKorsGen644mm-4.webp"
        },
        "description": "The Michael Kors Gen 6 is a stylish smartwatch with a 44mm case size, offering a blend of fashion and technology. With the latest generation features, it includes fitness tracking capabilities, heart rate monitoring, and various smartwatch functionalities. The watch likely runs on Wear OS, providing compatibility with both Android and iOS devices. Its 44mm size offers a substantial display for notifications, apps, and other smartwatch functions. Michael Kors is known for combining elegant design with smartwatch technology, making the Gen 6 a fashionable and functional accessory."
    },
    {
        "productName": "Apple iPad Pro 11 1TB M2 Wi-Fi Silver 2022",
        "category": "Tablets",
        "company": "Apple",
        "diagonal": 11,
        "resolution": "2388 x 1668",
        "storage": 1000,
        "cpu": "Apple M2",
        "color": "Silver",
        "price": 1799.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AppleiPadPro111TBM2WiFiSilver(MNXL3)2022-1.webp",
            "photoTwo": "/images/AppleiPadPro111TBM2WiFiSilver(MNXL3)2022-2.webp",
            "photoThree": "/images/AppleiPadPro111TBM2WiFiSilver(MNXL3)2022-3.webp",
            "photoFour": "/images/AppleiPadPro111TBM2WiFiSilver(MNXL3)2022-4.webp"
        },
        "description": "The Apple iPad Pro 11 (3rd generation) with a massive 1TB storage capacity and powered by the advanced M2 chip offers a remarkable tablet experience. Boasting an 11-inch Liquid Retina XDR display with ProMotion technology, it delivers stunning visuals with a high refresh rate. The M2 chip, equipped with a Neural Engine, ensures seamless performance for demanding tasks and creative workflows. The tablet supports the Apple Pencil (2nd generation) and the Magic Keyboard, enhancing its versatility for content creation and productivity. With USB-C connectivity, Face ID for secure authentication, and compatibility with powerful apps from the App Store, the iPad Pro 11 becomes a powerhouse for both personal and professional use."
    },
    {
        "productName": "Apple iPad Pro 11 2TB M2 Wi-Fi Silver 2022",
        "category": "Tablets",
        "company": "Apple",
        "diagonal": 11,
        "resolution": "2388 x 1668",
        "storage": 2000,
        "cpu": "Apple M2",
        "color": "Silver",
        "price": 1999.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AppleiPadPro111TBM2WiFiSilver(MNXL3)2022-1.webp",
            "photoTwo": "/images/AppleiPadPro111TBM2WiFiSilver(MNXL3)2022-2.webp",
            "photoThree": "/images/AppleiPadPro111TBM2WiFiSilver(MNXL3)2022-3.webp",
            "photoFour": "/images/AppleiPadPro111TBM2WiFiSilver(MNXL3)2022-4.webp"
        },
        "description": "The Apple iPad Pro 11 (3rd generation) with a massive 2TB storage capacity and powered by the advanced M2 chip offers a remarkable tablet experience. Boasting an 11-inch Liquid Retina XDR display with ProMotion technology, it delivers stunning visuals with a high refresh rate. The M2 chip, equipped with a Neural Engine, ensures seamless performance for demanding tasks and creative workflows. The tablet supports the Apple Pencil (2nd generation) and the Magic Keyboard, enhancing its versatility for content creation and productivity. With USB-C connectivity, Face ID for secure authentication, and compatibility with powerful apps from the App Store, the iPad Pro 11 becomes a powerhouse for both personal and professional use."
    },
    {
        "productName": "Apple iPad Air 10.9 64GB Wi-Fi Purple (MME23) 2022",
        "category": "Tablets",
        "company": "Apple",
        "diagonal": 10.9,
        "resolution": "2360 x 1640",
        "storage": 64,
        "cpu": "Apple M1",
        "color": "Purple",
        "price": 779.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AppleiPadAir10964GBWiFiPurple(MME23)2022-1.webp",
            "photoTwo": "/images/AppleiPadAir10964GBWiFiPurple(MME23)2022-2.webp",
            "photoThree": "/images/AppleiPadAir10964GBWiFiPurple(MME23)2022-4.webp"
        },
        "description": "The Apple iPad Air (4th generation) features a stunning 10.9-inch Liquid Retina display with True Tone and P3 wide color. Powered by the A14 Bionic chip with Neural Engine, the tablet offers a seamless and powerful performance. It incorporates Touch ID for secure authentication and Apple Pay. Equipped with a 12MP rear camera, it supports 4K video recording and a 7MP front camera with improved low-light performance. The iPad Air supports the 2nd generation Apple Pencil and the Magic Keyboard, providing enhanced creative and productivity capabilities. With USB-C connectivity, fast and efficient charging is possible, and it offers compatibility with a range of accessories. The tablet comes in various colors, adding a touch of personal style to its impressive features."
    },
    {
        "productName": "Apple iPad Air 10.9 64GB Wi-Fi Blue (MME23) 2022",
        "category": "Tablets",
        "company": "Apple",
        "diagonal": 10.9,
        "resolution": "2360 x 1640",
        "storage": 64,
        "cpu": "Apple M1",
        "color": "Blue",
        "price": 779.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AppleiPadAir109256GBWiFiBlue(MM9N3)2022-1.webp",
            "photoTwo": "/images/AppleiPadAir109256GBWiFiBlue(MM9N3)2022-2.webp",
            "photoThree": "/images/AppleiPadAir109256GBWiFiBlue(MM9N3)2022-3.webp"
        },
        "description": "The Apple iPad Air (4th generation) features a stunning 10.9-inch Liquid Retina display with True Tone and P3 wide color. Powered by the A14 Bionic chip with Neural Engine, the tablet offers a seamless and powerful performance. It incorporates Touch ID for secure authentication and Apple Pay. Equipped with a 12MP rear camera, it supports 4K video recording and a 7MP front camera with improved low-light performance. The iPad Air supports the 2nd generation Apple Pencil and the Magic Keyboard, providing enhanced creative and productivity capabilities. With USB-C connectivity, fast and efficient charging is possible, and it offers compatibility with a range of accessories. The tablet comes in various colors, adding a touch of personal style to its impressive features."
    },
    {
        "productName": "Apple iPad Air 10.9 128GB Wi-Fi Blue (MME23) 2022",
        "category": "Tablets",
        "company": "Apple",
        "diagonal": 10.9,
        "resolution": "2360 x 1640",
        "storage": 128,
        "cpu": "Apple M1",
        "color": "Blue",
        "price": 879.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AppleiPadAir109256GBWiFiBlue(MM9N3)2022-1.webp",
            "photoTwo": "/images/AppleiPadAir109256GBWiFiBlue(MM9N3)2022-2.webp",
            "photoThree": "/images/AppleiPadAir109256GBWiFiBlue(MM9N3)2022-3.webp"
        },
        "description": "The Apple iPad Air (4th generation) features a stunning 10.9-inch Liquid Retina display with True Tone and P3 wide color. Powered by the A14 Bionic chip with Neural Engine, the tablet offers a seamless and powerful performance. It incorporates Touch ID for secure authentication and Apple Pay. Equipped with a 12MP rear camera, it supports 4K video recording and a 7MP front camera with improved low-light performance. The iPad Air supports the 2nd generation Apple Pencil and the Magic Keyboard, providing enhanced creative and productivity capabilities. With USB-C connectivity, fast and efficient charging is possible, and it offers compatibility with a range of accessories. The tablet comes in various colors, adding a touch of personal style to its impressive features."
    },
    {
        "productName": "Apple iPad mini 8.3 64GB Wi-Fi Purple (MK7R3) 2021",
        "category": "Tablets",
        "company": "Apple",
        "diagonal": 8.3,
        "resolution": "2266 x 1488",
        "storage": 64,
        "cpu": "Apple A15",
        "color": "Purple",
        "price": 659.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AppleiPadmini8364GBWiFiPurple(MK7R3)2021-1.webp",
            "photoTwo": "/images/AppleiPadmini8364GBWiFiPurple(MK7R3)2021-2.webp",
            "photoThree": "/images/AppleiPadmini8364GBWiFiPurple(MK7R3)2021-3.webp"
        },
        "description": "The Apple iPad mini (6th generation) offers a vibrant 8.3-inch Liquid Retina display with True Tone and wide color, driven by the powerful A15 Bionic chip with Neural Engine. Featuring Touch ID for secure authentication and Apple Pay, it comes equipped with 12MP cameras, including Wide and Ultra Wide lenses, supporting Center Stage. The tablet is available in various stylish colors such as purple, starlight, pink, and space gray. Boasting landscape stereo speakers, ultrafast Wi-Fi 6 connectivity, and up to 10 hours of battery life, it ensures a seamless user experience. The inclusion of a USB-C connector for charging and accessories, along with compatibility with the Apple Pencil (2nd generation), enhances its versatility and functionality."
    },
    {
        "productName": "Apple iPad mini 8.3 128GB Wi-Fi Purple (MK7R3) 2021",
        "category": "Tablets",
        "company": "Apple",
        "diagonal": 8.3,
        "resolution": "2266 x 1488",
        "storage": 128,
        "cpu": "Apple A15",
        "color": "Purple",
        "price": 759.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/AppleiPadmini8364GBWiFiPurple(MK7R3)2021-1.webp",
            "photoTwo": "/images/AppleiPadmini8364GBWiFiPurple(MK7R3)2021-2.webp",
            "photoThree": "/images/AppleiPadmini8364GBWiFiPurple(MK7R3)2021-3.webp"
        },
        "description": "The Apple iPad mini (6th generation) offers a vibrant 8.3-inch Liquid Retina display with True Tone and wide color, driven by the powerful A15 Bionic chip with Neural Engine. Featuring Touch ID for secure authentication and Apple Pay, it comes equipped with 12MP cameras, including Wide and Ultra Wide lenses, supporting Center Stage. The tablet is available in various stylish colors such as purple, starlight, pink, and space gray. Boasting landscape stereo speakers, ultrafast Wi-Fi 6 connectivity, and up to 10 hours of battery life, it ensures a seamless user experience. The inclusion of a USB-C connector for charging and accessories, along with compatibility with the Apple Pencil (2nd generation), enhances its versatility and functionality."
    },
    {
        "productName": "Samsung Galaxy Tab А7 Lite 8.7 64Gb LTE Grey",
        "category": "Tablets",
        "company": "Samsung",
        "diagonal": 8.7,
        "resolution": "1340 x 800",
        "storage": 64,
        "cpu": "MediaTek Helio P22T",
        "color": "Grey",
        "price": 149.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/SamsungGalaxyTabА7Lite87464GbLTEGrey-1.webp",
            "photoTwo": "/images/SamsungGalaxyTabА7Lite87464GbLTEGrey-2.webp",
            "photoThree": "/images/SamsungGalaxyTabА7Lite87464GbLTEGrey-3.webp",
            "photoFour": "/images/SamsungGalaxyTabА7Lite87464GbLTEGrey-4.webp"
        },
        "description": "The Samsung Galaxy Tab A7 Lite, released in May 2021, is a budget-friendly Android tablet designed for everyday use. With an 8.7-inch TFT display and a resolution of 800 x 1340 pixels, it offers a compact and portable form factor. Powered by the MediaTek MT8768T processor with 3GB of RAM, it provides sufficient performance for basic tasks and multimedia consumption. The tablet comes in 32GB and 64GB storage variants, expandable via a microSD card. The 8 MP main camera and 2 MP front camera cater to essential photography needs. The 5,100 mAh battery ensures decent battery life, and it runs on Android 11 with Samsung's One UI, providing a user-friendly interface. The Galaxy Tab A7 Lite aims to deliver an affordable yet functional tablet experience for users seeking a reliable device for various daily activities."
    },
    {
        "productName": "Samsung Galaxy Tab А7 Lite 8.7 128Gb LTE Grey",
        "category": "Tablets",
        "company": "Samsung",
        "diagonal": 8.7,
        "resolution": "1340 x 800",
        "storage": 128,
        "cpu": "MediaTek Helio P22T",
        "color": "Grey",
        "price": 249.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/SamsungGalaxyTabА7Lite87464GbLTEGrey-1.webp",
            "photoTwo": "/images/SamsungGalaxyTabА7Lite87464GbLTEGrey-2.webp",
            "photoThree": "/images/SamsungGalaxyTabА7Lite87464GbLTEGrey-3.webp",
            "photoFour": "/images/SamsungGalaxyTabА7Lite87464GbLTEGrey-4.webp"
        },
        "description": "The Samsung Galaxy Tab A7 Lite, released in May 2021, is a budget-friendly Android tablet designed for everyday use. With an 8.7-inch TFT display and a resolution of 800 x 1340 pixels, it offers a compact and portable form factor. Powered by the MediaTek MT8768T processor with 3GB of RAM, it provides sufficient performance for basic tasks and multimedia consumption. The tablet comes in 32GB and 64GB storage variants, expandable via a microSD card. The 8 MP main camera and 2 MP front camera cater to essential photography needs. The 5,100 mAh battery ensures decent battery life, and it runs on Android 11 with Samsung's One UI, providing a user-friendly interface. The Galaxy Tab A7 Lite aims to deliver an affordable yet functional tablet experience for users seeking a reliable device for various daily activities."
    },
    {
        "productName": "Samsung Galaxy Tab S7 FE 12.4 64GB Wi-Fi Black",
        "category": "Tablets",
        "company": "Samsung",
        "diagonal": 12.4,
        "resolution": "2560 x 1600",
        "storage": 64,
        "cpu": "Qualcomm Snapdragon 750G",
        "color": "Black",
        "price": 549.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/Samsung GalaxyTabS7FE124464GBWiFiBlack-1.webp",
            "photoTwo": "/images/Samsung GalaxyTabS7FE124464GBWiFiBlack-2.webp",
            "photoThree": "/images/Samsung GalaxyTabS7FE124464GBWiFiBlack-3.webp",
            "photoFour": "/images/Samsung GalaxyTabS7FE124464GBWiFiBlack-4.webp"
        },
        "description": "The Samsung Galaxy Tab S7, introduced in August 2020, is a powerful Android tablet designed for productivity and entertainment. Boasting an 11-inch LTPS TFT display with a resolution of 1600 x 2560 pixels, it delivers vibrant visuals. Powered by the Qualcomm Snapdragon 865+ processor with options for 6GB or 8GB of RAM and storage ranging from 128GB to 256GB (expandable), the tablet ensures smooth performance. Notable features include S Pen stylus support for precise input and creativity and Samsung DeX mode for a desktop-like interface. With a dual-camera setup (13 MP main and 5 MP ultra-wide) on the back and an 8 MP front camera, the tablet offers versatile photography options. Supporting 5G connectivity in certain models, it provides fast internet speeds, and the 8,000 mAh battery ensures extended usage. Running on Samsung's One UI based on Android, the Galaxy Tab S7 aims to deliver a comprehensive tablet experience catering to both work and entertainment needs."
    },
    {
        "productName": "Samsung Galaxy Tab S7 FE 12.4 128GB Wi-Fi Black",
        "category": "Tablets",
        "company": "Samsung",
        "diagonal": 12.4,
        "resolution": "2560 x 1600",
        "storage": 128,
        "cpu": "Qualcomm Snapdragon 750G",
        "color": "Black",
        "price": 649.99,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/Samsung GalaxyTabS7FE124464GBWiFiBlack-1.webp",
            "photoTwo": "/images/Samsung GalaxyTabS7FE124464GBWiFiBlack-2.webp",
            "photoThree": "/images/Samsung GalaxyTabS7FE124464GBWiFiBlack-3.webp",
            "photoFour": "/images/Samsung GalaxyTabS7FE124464GBWiFiBlack-4.webp"
        },
        "description": "The Samsung Galaxy Tab S7, introduced in August 2020, is a powerful Android tablet designed for productivity and entertainment. Boasting an 11-inch LTPS TFT display with a resolution of 1600 x 2560 pixels, it delivers vibrant visuals. Powered by the Qualcomm Snapdragon 865+ processor with options for 6GB or 8GB of RAM and storage ranging from 128GB to 256GB (expandable), the tablet ensures smooth performance. Notable features include S Pen stylus support for precise input and creativity and Samsung DeX mode for a desktop-like interface. With a dual-camera setup (13 MP main and 5 MP ultra-wide) on the back and an 8 MP front camera, the tablet offers versatile photography options. Supporting 5G connectivity in certain models, it provides fast internet speeds, and the 8,000 mAh battery ensures extended usage. Running on Samsung's One UI based on Android, the Galaxy Tab S7 aims to deliver a comprehensive tablet experience catering to both work and entertainment needs."
    },
    {
        "productName": "Nintendo Switch Lite (Coral)",
        "category": "Game-Consoles",
        "company": "Nintendo",
        "color": "Coral",
        "price": 169.99,
        "storage": 32,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/NintendoSwitchLiteCoral-1.webp",
            "photoTwo": "/images/NintendoSwitchLiteCoral-2.webp",
            "photoThree": "/images/NintendoSwitchLiteCoral-3.webp",
            "photoFour": "/images/NintendoSwitchLiteCoral-4.webp",
            "photoFive": "/images/NintendoSwitchLiteCoral-5.webp"
        },
        "description": "The Nintendo Switch Lite is a handheld gaming console developed by Nintendo. Released on September 20, 2019, the Switch Lite is a more portable and budget-friendly version of the original Nintendo Switch. Unlike the standard Switch, the Lite model is designed exclusively for handheld play and cannot be docked to a TV. It features integrated controls, a smaller 5.5-inch screen, and a lightweight, compact design, making it suitable for on-the-go gaming. While it lacks detachable Joy-Con controllers and HD Rumble, the Switch Lite is compatible with most Nintendo Switch games that support handheld mode. The device comes in various colors and has become popular among gamers who prioritize handheld gaming and portability."
    },
    {
        "productName": "Nintendo Switch Lite (Blue)",
        "category": "Game-Consoles",
        "company": "Nintendo",
        "color": "Blue",
        "price": 169.99,
        "storage": 32,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/NintendoSwitchLiteBlue-1.webp",
            "photoTwo": "/images/NintendoSwitchLiteBlue-2.webp",
            "photoThree": "/images/NintendoSwitchLiteBlue-3.webp",
            "photoFour": "/images/NintendoSwitchLiteBlue-4.webp",
            "photoFive": "/images/NintendoSwitchLiteBlue-5.webp"
        },
        "description": "The Nintendo Switch Lite is a handheld gaming console developed by Nintendo. Released on September 20, 2019, the Switch Lite is a more portable and budget-friendly version of the original Nintendo Switch. Unlike the standard Switch, the Lite model is designed exclusively for handheld play and cannot be docked to a TV. It features integrated controls, a smaller 5.5-inch screen, and a lightweight, compact design, making it suitable for on-the-go gaming. While it lacks detachable Joy-Con controllers and HD Rumble, the Switch Lite is compatible with most Nintendo Switch games that support handheld mode. The device comes in various colors and has become popular among gamers who prioritize handheld gaming and portability."
    },
    {
        "productName": "Nintendo Switch Lite (Turquoise)",
        "category": "Game-Consoles",
        "company": "Nintendo",
        "color": "Turquoise",
        "price": 169.99,
        "storage": 32,
        "inStock": true,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/NintendoSwitchLiteTurquoise-1.webp",
            "photoTwo": "/images/NintendoSwitchLiteTurquoise-2.webp",
            "photoThree": "/images/NintendoSwitchLiteTurquoise-3.webp",
            "photoFour": "/images/NintendoSwitchLiteTurquoise-4.webp"
        },
        "description": "The Nintendo Switch Lite is a handheld gaming console developed by Nintendo. Released on September 20, 2019, the Switch Lite is a more portable and budget-friendly version of the original Nintendo Switch. Unlike the standard Switch, the Lite model is designed exclusively for handheld play and cannot be docked to a TV. It features integrated controls, a smaller 5.5-inch screen, and a lightweight, compact design, making it suitable for on-the-go gaming. While it lacks detachable Joy-Con controllers and HD Rumble, the Switch Lite is compatible with most Nintendo Switch games that support handheld mode. The device comes in various colors and has become popular among gamers who prioritize handheld gaming and portability."
    },
    {
        "productName": "Nintendo Switch OLED (Neon Blue-Neon Red set)",
        "category": "Game-Consoles",
        "company": "Nintendo",
        "color": "Red&Blue",
        "price": 349.99,
        "storage": 64,
        "inStock": false,
        "isFavorite": false,
        "photos": {
            "photoOne": "/images/NintendoSwitchOLEDModelNeonBlueNeonRedset-1.webp",
            "photoTwo": "/images/NintendoSwitchOLEDModelNeonBlueNeonRedset-2.webp",
            "photoThree": "/images/NintendoSwitchOLEDModelNeonBlueNeonRedset-3.webp",
            "photoFour": "/images/NintendoSwitchOLEDModelNeonBlueNeonRedset-4.webp"
        },
        "description": "The Nintendo Switch OLED is a gaming console that features a vibrant 7-inch OLED screen for enhanced visuals and colors. The white color variant adds a stylish and modern touch to the design. With a versatile gaming experience, it allows users to seamlessly transition between handheld, tabletop, and TV modes. The OLED screen provides sharp and vivid graphics, making gaming more immersive. The console retains the signature features of the Nintendo Switch, such as detachable Joy-Con controllers for multiplayer gaming and the innovative ability to dock and connect to the TV for a big-screen experience. The enhanced audio quality further adds to the immersive gaming experience. Whether playing popular titles or exploring new games, the Nintendo Switch OLED White offers a versatile and enjoyable gaming platform. It caters to a wide audience, from casual gamers to dedicated enthusiasts, and its portability makes it convenient for gaming on the go. Overall, the combination of the OLED display and the sleek white design makes the Nintendo Switch OLED White an appealing choice for gaming enthusiasts."
    }
]
